20210923125314-css.org
:PROPERTIES:
:ID:       94fdcf08-7516-4aca-a2e6-629dc55dce83
:END:
#+title: CSS
* 概要
CSSは[[id:9f5b7514-d5e5-4997-81b0-bd453775415c][HTML]]をどのように表示するかを指定する仕様のこと。
* Memo
** テーブルの間隔を指定する
#+begin_export css
table {
  border-spacing: 2em;
  border-collapse: separate;
}
#+end_export
** tbodyに間隔を指定する
~border-spacing~ は使えないので、要素を挿入して間を開けるしかない。
#+begin_export css
tbody::before
{
  content: '';
  display: block;
  height: 1em;
}
#+end_export

- https://stackoverflow.com/questions/294885/how-to-put-spacing-between-tbody-elements/296352
* Tasks
* Reference
** [[https://9elements.github.io/fancy-border-radius/][Fancy Border Radius Generator]]
css borderで曲線を作るときに便利なツール。
** [[https://waaz.xyz/adding-external-link-indicator-with-css/][Adding External Link Indicator with CSS - Waaz Solutions]]
ありがちな間違いを除外してリンク付けの正確性を高める例。
** [[https://www.rectus.co.jp/archives/329][CSSだけで外部サイトへのリンクにマーク(アイコン)をつける方法 | 株式会社レクタス]]
CSSで完結して便利。
** [[https://blog.testdouble.com/talks/2021-06-03-how-to-find-and-remove-dead-css/][How to Find and Remove Dead CSS]]
使われてないCSSを見つける方法。
** [[https://design.dena.com/design/atomic-design-%E3%82%92%E5%88%86%E3%81%8B%E3%81%A3%E3%81%9F%E3%81%A4%E3%82%82%E3%82%8A%E3%81%AB%E3%81%AA%E3%82%8B][Atomic Design を分かったつもりになる - DeNA Design]]
関数型プログラミングのように、小さな部品から作って組み合わせる、という方式。
* Archives
