20210923125314-css.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-10-15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>CSS</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">CSS</h1>
<div id="outline-container-org02d5390" class="outline-2">
<h2 id="org02d5390"><a href="#org02d5390">概要</a></h2>
<div class="outline-text-2" id="text-org02d5390">
<p>
CSSは<a href="20210923124913-html.html#ID-9f5b7514-d5e5-4997-81b0-bd453775415c">HTML</a>をどのように表示するかを指定する仕様のこと。
</p>
</div>
</div>
<div id="outline-container-orgf63d50e" class="outline-2">
<h2 id="orgf63d50e"><a href="#orgf63d50e">Memo</a></h2>
<div class="outline-text-2" id="text-orgf63d50e">
</div>
<div id="outline-container-org4ada060" class="outline-3">
<h3 id="org4ada060"><a href="#org4ada060">テーブルの間隔を指定する</a></h3>
<div class="outline-text-3" id="text-org4ada060">
</div>
</div>
<div id="outline-container-orga6d4638" class="outline-3">
<h3 id="orga6d4638"><a href="#orga6d4638">tbodyに間隔を指定する</a></h3>
<div class="outline-text-3" id="text-orga6d4638">
<p>
<code>border-spacing</code> は使えないので、要素を挿入して間を開けるしかない。
</p>
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/294885/how-to-put-spacing-between-tbody-elements/296352">https://stackoverflow.com/questions/294885/how-to-put-spacing-between-tbody-elements/296352</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga926104" class="outline-2">
<h2 id="orga926104"><a href="#orga926104">Tasks</a></h2>
</div>
<div id="outline-container-org7084f35" class="outline-2">
<h2 id="org7084f35"><a href="#org7084f35">Reference</a></h2>
<div class="outline-text-2" id="text-org7084f35">
</div>
<div id="outline-container-orgc538983" class="outline-3">
<h3 id="orgc538983"><a href="#orgc538983"><a href="https://9elements.github.io/fancy-border-radius/">Fancy Border Radius Generator</a></a></h3>
<div class="outline-text-3" id="text-orgc538983">
<p>
css borderで曲線を作るときに便利なツール。
</p>
</div>
</div>
<div id="outline-container-orgcc7c0b0" class="outline-3">
<h3 id="orgcc7c0b0"><a href="#orgcc7c0b0"><a href="https://waaz.xyz/adding-external-link-indicator-with-css/">Adding External Link Indicator with CSS - Waaz Solutions</a></a></h3>
<div class="outline-text-3" id="text-orgcc7c0b0">
<p>
ありがちな間違いを除外してリンク付けの正確性を高める例。
</p>
</div>
</div>
<div id="outline-container-org76080aa" class="outline-3">
<h3 id="org76080aa"><a href="#org76080aa"><a href="https://www.rectus.co.jp/archives/329">CSSだけで外部サイトへのリンクにマーク(アイコン)をつける方法 | 株式会社レクタス</a></a></h3>
<div class="outline-text-3" id="text-org76080aa">
<p>
CSSで完結して便利。
</p>
</div>
</div>
<div id="outline-container-orga4389f4" class="outline-3">
<h3 id="orga4389f4"><a href="#orga4389f4"><a href="https://blog.testdouble.com/talks/2021-06-03-how-to-find-and-remove-dead-css/">How to Find and Remove Dead CSS</a></a></h3>
<div class="outline-text-3" id="text-orga4389f4">
<p>
使われてないCSSを見つける方法。
</p>
</div>
</div>
<div id="outline-container-org40a1b67" class="outline-3">
<h3 id="org40a1b67"><a href="#org40a1b67"><a href="https://design.dena.com/design/atomic-design-%E3%82%92%E5%88%86%E3%81%8B%E3%81%A3%E3%81%9F%E3%81%A4%E3%82%82%E3%82%8A%E3%81%AB%E3%81%AA%E3%82%8B">Atomic Design を分かったつもりになる - DeNA Design</a></a></h3>
<div class="outline-text-3" id="text-org40a1b67">
<p>
関数型プログラミングのように、小さな部品から作って組み合わせる、という方式。
</p>
</div>
</div>
</div>
<div id="outline-container-orge0c6713" class="outline-2">
<h2 id="orge0c6713"><a href="#orge0c6713">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
